JackTJH/STM32F407/21_AD9833(Pro)Practice/APPLICATION/OLED(0.96)/OLED.c

/***************************************************************************************
  * 本程序由江协科技创建并免费开源共享
  * 你可以任意查看、使用和修改，并应用到自己的项目之中
  * 程序版权归江协科技所有，任何人或组织不得将其据为己有
  * 
  * 程序名称：				0.96寸OLED显示屏驱动程序（4针脚I2C接口）
  * 程序创建时间：			2023.10.24
  * 当前程序版本：			V2.0
  * 当前版本发布时间：		2024.10.20
  * 
  * 江协科技官方网站：		jiangxiekeji.com
  * 江协科技官方淘宝店：	jiangxiekeji.taobao.com
  * 程序介绍及更新动态：	jiangxiekeji.com/tutorial/oled.html
  * 
  * 如果你发现程序中的漏洞或者笔误，可通过邮件向我们反馈：feedback@jiangxiekeji.com
  * 发送邮件之前，你可以先到更新动态页面查看最新程序，如果此问题已经修改，则无需再发邮件
  ***************************************************************************************
  */

#include "stm32f4xx.h"
#include "OLED.h"
#include "delay.h"
#include <string.h>
#include <math.h>
#include <stdio.h>
#include <stdarg.h>

const uint8_t font8_16[][16] = {
0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,/*" ",0*/
0x00,0x00,0x00,0xF8,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x33,0x00,0x00,0x00,0x00,/*"!",1*/
0x00,0x10,0x0C,0x02,0x10,0x0C,0x02,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,/*""",2*/
0x00,0x40,0xC0,0x78,0x40,0xC0,0x78,0x00,0x00,0x04,0x3F,0x04,0x04,0x3F,0x04,0x00,/*"#",3*/
0x00,0x70,0x88,0x88,0xFC,0x08,0x30,0x00,0x00,0x18,0x20,0x20,0xFF,0x21,0x1E,0x00,/*"$",4*/
0xF0,0x08,0xF0,0x80,0x60,0x18,0x00,0x00,0x00,0x31,0x0C,0x03,0x1E,0x21,0x1E,0x00,/*"%",5*/
0x00,0xF0,0x08,0x88,0x70,0x00,0x00,0x00,0x1E,0x21,0x23,0x2C,0x19,0x27,0x21,0x10,/*"&",6*/
0x00,0x12,0x0E,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,/*"'",7*/
0x00,0x00,0x00,0xE0,0x18,0x04,0x02,0x00,0x00,0x00,0x00,0x07,0x18,0x20,0x40,0x00,/*"(",8*/
0x00,0x02,0x04,0x18,0xE0,0x00,0x00,0x00,0x00,0x40,0x20,0x18,0x07,0x00,0x00,0x00,/*")",9*/
0x40,0x40,0x80,0xF0,0x80,0x40,0x40,0x00,0x02,0x02,0x01,0x0F,0x01,0x02,0x02,0x00,/*"*",10*/
0x00,0x00,0x00,0x00,0xE0,0x00,0x00,0x00,0x00,0x01,0x01,0x01,0x0F,0x01,0x01,0x01,/*"+",11*/
0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x90,0x70,0x00,0x00,0x00,0x00,0x00,/*",",12*/
0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x01,0x01,0x01,0x01,0x01,0x01,0x00,/*"-",13*/
0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x30,0x30,0x00,0x00,0x00,0x00,0x00,/*".",14*/
0x00,0x00,0x00,0x00,0xC0,0x38,0x04,0x00,0x00,0x60,0x18,0x07,0x00,0x00,0x00,0x00,/*"/",15*/
0x00,0xE0,0x10,0x08,0x08,0x10,0xE0,0x00,0x00,0x0F,0x10,0x20,0x20,0x10,0x0F,0x00,/*"0",16*/
0x00,0x00,0x10,0x10,0xF8,0x00,0x00,0x00,0x00,0x00,0x20,0x20,0x3F,0x20,0x20,0x00,/*"1",17*/
0x00,0x70,0x08,0x08,0x08,0x08,0xF0,0x00,0x00,0x30,0x28,0x24,0x22,0x21,0x30,0x00,/*"2",18*/
0x00,0x30,0x08,0x08,0x08,0x88,0x70,0x00,0x00,0x18,0x20,0x21,0x21,0x22,0x1C,0x00,/*"3",19*/
0x00,0x00,0x80,0x40,0x30,0xF8,0x00,0x00,0x00,0x06,0x05,0x24,0x24,0x3F,0x24,0x24,/*"4",20*/
0x00,0xF8,0x88,0x88,0x88,0x08,0x08,0x00,0x00,0x19,0x20,0x20,0x20,0x11,0x0E,0x00,/*"5",21*/
0x00,0xE0,0x10,0x88,0x88,0x90,0x00,0x00,0x00,0x0F,0x11,0x20,0x20,0x20,0x1F,0x00,/*"6",22*/
0x00,0x18,0x08,0x08,0x88,0x68,0x18,0x00,0x00,0x00,0x00,0x3E,0x01,0x00,0x00,0x00,/*"7",23*/
0x00,0x70,0x88,0x08,0x08,0x88,0x70,0x00,0x00,0x1C,0x22,0x21,0x21,0x22,0x1C,0x00,/*"8",24*/
0x00,0xF0,0x08,0x08,0x08,0x10,0xE0,0x00,0x00,0x01,0x12,0x22,0x22,0x11,0x0F,0x00,/*"9",25*/
0x00,0x00,0x00,0xC0,0xC0,0x00,0x00,0x00,0x00,0x00,0x00,0x30,0x30,0x00,0x00,0x00,/*":",26*/
0x00,0x00,0x00,0x80,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0xE0,0x00,0x00,0x00,0x00,/*";",27*/
0x00,0x00,0x80,0x40,0x20,0x10,0x08,0x00,0x00,0x01,0x02,0x04,0x08,0x10,0x20,0x00,/*"<",28*/
0x00,0x40,0x40,0x40,0x40,0x40,0x40,0x00,0x00,0x02,0x02,0x02,0x02,0x02,0x02,0x00,/*"=",29*/
0x00,0x08,0x10,0x20,0x40,0x80,0x00,0x00,0x00,0x20,0x10,0x08,0x04,0x02,0x01,0x00,/*">",30*/
0x00,0x70,0x48,0x08,0x08,0x88,0x70,0x00,0x00,0x00,0x00,0x30,0x37,0x00,0x00,0x00,/*"?",31*/
0xC0,0x30,0xC8,0x28,0xE8,0x10,0xE0,0x00,0x07,0x18,0x27,0x28,0x2F,0x28,0x17,0x00,/*"@",32*/
0x00,0x00,0xC0,0x38,0xE0,0x00,0x00,0x00,0x20,0x3C,0x23,0x02,0x02,0x27,0x38,0x20,/*"A",33*/
0x08,0xF8,0x88,0x88,0x88,0x70,0x00,0x00,0x20,0x3F,0x20,0x20,0x20,0x11,0x0E,0x00,/*"B",34*/
0xC0,0x30,0x08,0x08,0x08,0x08,0x38,0x00,0x07,0x18,0x20,0x20,0x20,0x10,0x08,0x00,/*"C",35*/
0x08,0xF8,0x08,0x08,0x08,0x10,0xE0,0x00,0x20,0x3F,0x20,0x20,0x20,0x10,0x0F,0x00,/*"D",36*/
0x08,0xF8,0x88,0x88,0xE8,0x08,0x10,0x00,0x20,0x3F,0x20,0x20,0x23,0x20,0x18,0x00,/*"E",37*/
0x08,0xF8,0x88,0x88,0xE8,0x08,0x10,0x00,0x20,0x3F,0x20,0x00,0x03,0x00,0x00,0x00,/*"F",38*/
0xC0,0x30,0x08,0x08,0x08,0x38,0x00,0x00,0x07,0x18,0x20,0x20,0x22,0x1E,0x02,0x00,/*"G",39*/
0x08,0xF8,0x08,0x00,0x00,0x08,0xF8,0x08,0x20,0x3F,0x21,0x01,0x01,0x21,0x3F,0x20,/*"H",40*/
0x00,0x08,0x08,0xF8,0x08,0x08,0x00,0x00,0x00,0x20,0x20,0x3F,0x20,0x20,0x00,0x00,/*"I",41*/
0x00,0x00,0x08,0x08,0xF8,0x08,0x08,0x00,0xC0,0x80,0x80,0x80,0x7F,0x00,0x00,0x00,/*"J",42*/
0x08,0xF8,0x88,0xC0,0x28,0x18,0x08,0x00,0x20,0x3F,0x20,0x01,0x26,0x38,0x20,0x00,/*"K",43*/
0x08,0xF8,0x08,0x00,0x00,0x00,0x00,0x00,0x20,0x3F,0x20,0x20,0x20,0x20,0x30,0x00,/*"L",44*/
0x08,0xF8,0xF8,0x00,0xF8,0xF8,0x08,0x00,0x20,0x3F,0x01,0x3E,0x01,0x3F,0x20,0x00,/*"M",45*/
0x08,0xF8,0x30,0xC0,0x00,0x08,0xF8,0x08,0x20,0x3F,0x20,0x00,0x07,0x18,0x3F,0x00,/*"N",46*/
0xE0,0x10,0x08,0x08,0x08,0x10,0xE0,0x00,0x0F,0x10,0x20,0x20,0x20,0x10,0x0F,0x00,/*"O",47*/
0x08,0xF8,0x08,0x08,0x08,0x08,0xF0,0x00,0x20,0x3F,0x21,0x01,0x01,0x01,0x00,0x00,/*"P",48*/
0xE0,0x10,0x08,0x08,0x08,0x10,0xE0,0x00,0x0F,0x10,0x28,0x28,0x30,0x50,0x4F,0x00,/*"Q",49*/
0x08,0xF8,0x88,0x88,0x88,0x88,0x70,0x00,0x20,0x3F,0x20,0x00,0x03,0x0C,0x30,0x20,/*"R",50*/
0x00,0x70,0x88,0x08,0x08,0x08,0x38,0x00,0x00,0x38,0x20,0x21,0x21,0x22,0x1C,0x00,/*"S",51*/
0x18,0x08,0x08,0xF8,0x08,0x08,0x18,0x00,0x00,0x00,0x20,0x3F,0x20,0x00,0x00,0x00,/*"T",52*/
0x08,0xF8,0x08,0x00,0x00,0x08,0xF8,0x08,0x00,0x1F,0x20,0x20,0x20,0x20,0x1F,0x00,/*"U",53*/
0x08,0x78,0x88,0x00,0x00,0xC8,0x38,0x08,0x00,0x00,0x07,0x38,0x0E,0x01,0x00,0x00,/*"V",54*/
0x08,0xF8,0x00,0xF8,0x00,0xF8,0x08,0x00,0x00,0x03,0x3E,0x01,0x3E,0x03,0x00,0x00,/*"W",55*/
0x08,0x18,0x68,0x80,0x80,0x68,0x18,0x08,0x20,0x30,0x2C,0x03,0x03,0x2C,0x30,0x20,/*"X",56*/
0x08,0x38,0xC8,0x00,0xC8,0x38,0x08,0x00,0x00,0x00,0x20,0x3F,0x20,0x00,0x00,0x00,/*"Y",57*/
0x10,0x08,0x08,0x08,0xC8,0x38,0x08,0x00,0x20,0x38,0x26,0x21,0x20,0x20,0x18,0x00,/*"Z",58*/
0x00,0x00,0x00,0xFE,0x02,0x02,0x02,0x00,0x00,0x00,0x00,0x7F,0x40,0x40,0x40,0x00,/*"[",59*/
0x00,0x04,0x38,0xC0,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x01,0x06,0x38,0xC0,0x00,/*"\",60*/
0x00,0x02,0x02,0x02,0xFE,0x00,0x00,0x00,0x00,0x40,0x40,0x40,0x7F,0x00,0x00,0x00,/*"]",61*/
0x00,0x00,0x04,0x02,0x02,0x04,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,/*"^",62*/
0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x80,0x80,0x80,0x80,0x80,0x80,0x80,0x80,/*"_",63*/
0x00,0x02,0x02,0x04,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,/*"`",64*/
0x00,0x00,0x80,0x80,0x80,0x00,0x00,0x00,0x00,0x19,0x24,0x24,0x12,0x3F,0x20,0x00,/*"a",65*/
0x10,0xF0,0x00,0x80,0x80,0x00,0x00,0x00,0x00,0x3F,0x11,0x20,0x20,0x11,0x0E,0x00,/*"b",66*/
0x00,0x00,0x00,0x80,0x80,0x80,0x00,0x00,0x00,0x0E,0x11,0x20,0x20,0x20,0x11,0x00,/*"c",67*/
0x00,0x00,0x80,0x80,0x80,0x90,0xF0,0x00,0x00,0x1F,0x20,0x20,0x20,0x10,0x3F,0x20,/*"d",68*/
0x00,0x00,0x80,0x80,0x80,0x80,0x00,0x00,0x00,0x1F,0x24,0x24,0x24,0x24,0x17,0x00,/*"e",69*/
0x00,0x80,0x80,0xE0,0x90,0x90,0x20,0x00,0x00,0x20,0x20,0x3F,0x20,0x20,0x00,0x00,/*"f",70*/
0x00,0x00,0x80,0x80,0x80,0x80,0x80,0x00,0x00,0x6B,0x94,0x94,0x94,0x93,0x60,0x00,/*"g",71*/
0x10,0xF0,0x00,0x80,0x80,0x80,0x00,0x00,0x20,0x3F,0x21,0x00,0x00,0x20,0x3F,0x20,/*"h",72*/
0x00,0x80,0x98,0x98,0x00,0x00,0x00,0x00,0x00,0x20,0x20,0x3F,0x20,0x20,0x00,0x00,/*"i",73*/
0x00,0x00,0x00,0x80,0x98,0x98,0x00,0x00,0x00,0xC0,0x80,0x80,0x80,0x7F,0x00,0x00,/*"j",74*/
0x10,0xF0,0x00,0x00,0x80,0x80,0x80,0x00,0x20,0x3F,0x24,0x06,0x29,0x30,0x20,0x00,/*"k",75*/
0x00,0x10,0x10,0xF8,0x00,0x00,0x00,0x00,0x00,0x20,0x20,0x3F,0x20,0x20,0x00,0x00,/*"l",76*/
0x80,0x80,0x80,0x80,0x80,0x80,0x80,0x00,0x20,0x3F,0x20,0x00,0x3F,0x20,0x00,0x3F,/*"m",77*/
0x80,0x80,0x00,0x80,0x80,0x80,0x00,0x00,0x20,0x3F,0x21,0x00,0x00,0x20,0x3F,0x20,/*"n",78*/
0x00,0x00,0x80,0x80,0x80,0x80,0x00,0x00,0x00,0x1F,0x20,0x20,0x20,0x20,0x1F,0x00,/*"o",79*/
0x80,0x80,0x00,0x80,0x80,0x00,0x00,0x00,0x80,0xFF,0x91,0x20,0x20,0x11,0x0E,0x00,/*"p",80*/
0x00,0x00,0x00,0x80,0x80,0x00,0x80,0x00,0x00,0x0E,0x11,0x20,0x20,0x91,0xFF,0x80,/*"q",81*/
0x80,0x80,0x80,0x00,0x80,0x80,0x80,0x00,0x20,0x20,0x3F,0x21,0x20,0x00,0x01,0x00,/*"r",82*/
0x00,0x00,0x80,0x80,0x80,0x80,0x80,0x00,0x00,0x33,0x24,0x24,0x24,0x24,0x19,0x00,/*"s",83*/
0x00,0x80,0x80,0xE0,0x80,0x80,0x00,0x00,0x00,0x00,0x00,0x1F,0x20,0x20,0x10,0x00,/*"t",84*/
0x80,0x80,0x00,0x00,0x00,0x80,0x80,0x00,0x00,0x1F,0x20,0x20,0x20,0x10,0x3F,0x20,/*"u",85*/
0x80,0x80,0x80,0x00,0x80,0x80,0x80,0x00,0x00,0x03,0x0C,0x30,0x0C,0x03,0x00,0x00,/*"v",86*/
0x80,0x80,0x00,0x80,0x80,0x00,0x80,0x80,0x01,0x0E,0x30,0x0C,0x07,0x38,0x06,0x01,/*"w",87*/
0x00,0x80,0x80,0x80,0x00,0x80,0x80,0x00,0x00,0x20,0x31,0x0E,0x2E,0x31,0x20,0x00,/*"x",88*/
0x80,0x80,0x80,0x00,0x00,0x80,0x80,0x80,0x00,0x81,0x86,0x78,0x18,0x06,0x01,0x00,/*"y",89*/
0x00,0x80,0x80,0x80,0x80,0x80,0x80,0x00,0x00,0x21,0x30,0x2C,0x22,0x21,0x30,0x00,/*"z",90*/
0x00,0x00,0x00,0x00,0x00,0xFC,0x02,0x02,0x00,0x00,0x00,0x00,0x01,0x3E,0x40,0x40,/*"{",91*/
0x00,0x00,0x00,0x00,0xFF,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0xFF,0x00,0x00,0x00,/*"|",92*/
0x02,0x02,0xFC,0x00,0x00,0x00,0x00,0x00,0x40,0x40,0x3E,0x01,0x00,0x00,0x00,0x00,/*"}",93*/
0x00,0x02,0x01,0x02,0x02,0x04,0x02,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,/*"~",94*/
};

const uint8_t font6_8[][6] = {
0x00,0x00,0x00,0x00,0x00,0x00,/*" ",0*/
0x00,0x00,0x4C,0x40,0x00,0x00,/*"!",1*/
0x00,0x02,0x02,0x02,0x00,0x00,/*""",2*/
0x20,0x7C,0x28,0x28,0x3E,0x20,/*"#",3*/
0x00,0x6C,0x4A,0x74,0x24,0x00,/*"$",4*/
0x0C,0x52,0x3C,0x7C,0x52,0x70,/*"%",5*/
0x30,0x4C,0x7A,0x6C,0x50,0x40,/*"&",6*/
0x00,0x02,0x00,0x00,0x00,0x00,/*"'",7*/
0x00,0x00,0x00,0x7C,0x82,0x00,/*"(",8*/
0x00,0x42,0x3C,0x00,0x00,0x00,/*")",9*/
0x00,0x18,0x38,0x10,0x18,0x00,/*"*",10*/
0x00,0x00,0x10,0x18,0x10,0x00,/*"+",11*/
0x00,0xC0,0x00,0x00,0x00,0x00,/*",",12*/
0x08,0x08,0x08,0x08,0x08,0x08,/*"-",13*/
0x00,0x40,0x00,0x00,0x00,0x00,/*".",14*/
0x00,0x40,0x30,0x08,0x06,0x00,/*"/",15*/
0x00,0x7C,0x42,0x42,0x7C,0x00,/*"0",16*/
0x00,0x00,0x44,0x7C,0x00,0x00,/*"1",17*/
0x00,0x64,0x62,0x52,0x4C,0x00,/*"2",18*/
0x00,0x64,0x42,0x4A,0x7C,0x00,/*"3",19*/
0x00,0x10,0x28,0x7C,0x20,0x00,/*"4",20*/
0x00,0x6C,0x4C,0x4C,0x70,0x00,/*"5",21*/
0x00,0x7C,0x4A,0x4A,0x74,0x00,/*"6",22*/
0x00,0x04,0x64,0x1C,0x04,0x00,/*"7",23*/
0x00,0x7C,0x4A,0x52,0x7C,0x00,/*"8",24*/
0x00,0x5C,0x52,0x52,0x3C,0x00,/*"9",25*/
0x00,0x00,0x48,0x48,0x00,0x00,/*":",26*/
0x00,0x00,0xC8,0x00,0x00,0x00,/*";",27*/
0x00,0x18,0x28,0x24,0x42,0x00,/*"<",28*/
0x00,0x18,0x18,0x18,0x18,0x00,/*"=",29*/
0x00,0x42,0x24,0x28,0x18,0x00,/*">",30*/
0x00,0x04,0x62,0x52,0x0C,0x00,/*"?",31*/
0x18,0x64,0x7A,0x56,0x6C,0x18,/*"@",32*/
0x40,0x30,0x1C,0x1C,0x70,0x00,/*"A",33*/
0x00,0x7C,0x54,0x54,0x5C,0x20,/*"B",34*/
0x18,0x64,0x42,0x42,0x42,0x24,/*"C",35*/
0x00,0x7C,0x44,0x44,0x24,0x18,/*"D",36*/
0x00,0x7C,0x54,0x54,0x44,0x00,/*"E",37*/
0x00,0x7C,0x14,0x14,0x1C,0x04,/*"F",38*/
0x38,0x44,0x42,0x42,0x64,0x00,/*"G",39*/
0x00,0x7C,0x10,0x10,0x7C,0x00,/*"H",40*/
0x00,0x00,0x7C,0x44,0x00,0x00,/*"I",41*/
0x80,0x80,0x80,0xFC,0x04,0x00,/*"J",42*/
0x00,0x7C,0x08,0x34,0x40,0x00,/*"K",43*/
0x00,0x7C,0x40,0x40,0x40,0x00,/*"L",44*/
0x70,0x4C,0x70,0x10,0x7C,0x00,/*"M",45*/
0x00,0x7C,0x08,0x10,0x3C,0x00,/*"N",46*/
0x18,0x64,0x42,0x42,0x44,0x38,/*"O",47*/
0x00,0x7C,0x14,0x14,0x0C,0x04,/*"P",48*/
0x38,0x44,0x62,0x42,0xC4,0x38,/*"Q",49*/
0x00,0x7C,0x14,0x14,0x6C,0x00,/*"R",50*/
0x00,0x4C,0x4A,0x52,0x74,0x00,/*"S",51*/
0x04,0x04,0x7C,0x04,0x04,0x04,/*"T",52*/
0x00,0x7C,0x40,0x40,0x7C,0x00,/*"U",53*/
0x00,0x0C,0x30,0x30,0x0C,0x00,/*"V",54*/
0x00,0x3C,0x14,0x3C,0x1C,0x04,/*"W",55*/
0x00,0x44,0x28,0x38,0x44,0x00,/*"X",56*/
0x00,0x04,0x78,0x08,0x04,0x00,/*"Y",57*/
0x00,0x64,0x54,0x4C,0x44,0x00,/*"Z",58*/
0x00,0x00,0xFE,0x82,0x80,0x00,/*"[",59*/
0x00,0x06,0x08,0x30,0x40,0x00,/*"\",60*/
0x00,0x80,0x82,0xFE,0x00,0x00,/*"]",61*/
0x00,0x01,0x01,0x01,0x01,0x00,/*"^",62*/
0x80,0x80,0x80,0x80,0x80,0x80,/*"_",63*/
0x00,0x01,0x01,0x00,0x00,0x00,/*"`",64*/
0x00,0x60,0x58,0x58,0x70,0x40,/*"a",65*/
0x00,0x7E,0x48,0x48,0x70,0x00,/*"b",66*/
0x00,0x70,0x48,0x48,0x40,0x00,/*"c",67*/
0x00,0x70,0x48,0x48,0x7E,0x40,/*"d",68*/
0x00,0x70,0x68,0x68,0x50,0x00,/*"e",69*/
0x00,0x08,0x7C,0x0C,0x0C,0x00,/*"f",70*/
0x00,0xF0,0xE8,0xE8,0xD8,0x08,/*"g",71*/
0x00,0x7E,0x08,0x08,0x70,0x00,/*"h",72*/
0x00,0x08,0x78,0x40,0x00,0x00,/*"i",73*/
0x00,0x80,0x80,0x88,0x7A,0x00,/*"j",74*/
0x00,0x7E,0x10,0x38,0x48,0x00,/*"k",75*/
0x00,0x00,0x7E,0x40,0x00,0x00,/*"l",76*/
0x78,0x48,0x48,0x70,0x48,0x70,/*"m",77*/
0x08,0x78,0x08,0x08,0x70,0x00,/*"n",78*/
0x00,0x70,0x48,0x48,0x70,0x00,/*"o",79*/
0x08,0xF8,0x48,0x48,0x70,0x00,/*"p",80*/
0x00,0x70,0x48,0x48,0xF0,0x00,/*"q",81*/
0x08,0x48,0x70,0x08,0x08,0x00,/*"r",82*/
0x00,0x50,0x58,0x68,0x68,0x00,/*"s",83*/
0x00,0x08,0x7C,0x48,0x48,0x00,/*"t",84*/
0x08,0x78,0x40,0x40,0x78,0x40,/*"u",85*/
0x08,0x18,0x20,0x20,0x18,0x00,/*"v",86*/
0x08,0x38,0x28,0x38,0x38,0x08,/*"w",87*/
0x00,0x48,0x38,0x38,0x48,0x00,/*"x",88*/
0x00,0x98,0xA0,0x60,0x18,0x08,/*"y",89*/
0x00,0x48,0x68,0x58,0x48,0x00,/*"z",90*/
0x00,0x00,0x00,0x7E,0x80,0x00,/*"{",91*/
0x00,0x00,0x00,0xFF,0x00,0x00,/*"|",92*/
0x00,0x80,0x7E,0x00,0x00,0x00,/*"}",93*/
0x00,0x01,0x01,0x02,0x02,0x00,/*"~",94*/
};

const uint8_t font4_8[][4] = {
0x00,0x00,0x00,0x00,/*" ",0*/
0x00,0x00,0x5E,0x00,/*"!",1*/
0x00,0x04,0x06,0x02,/*""",2*/
0x24,0x3C,0x24,0x3C,/*"#",3*/
0x00,0x4C,0xFE,0x00,/*"$",4*/
0x1E,0x7A,0x5E,0x78,/*"%",5*/
0x70,0x5E,0x3E,0x48,/*"&",6*/
0x00,0x06,0x00,0x00,/*"'",7*/
0x00,0x00,0x7C,0x82,/*"(",8*/
0x42,0x3C,0x00,0x00,/*")",9*/
0x18,0x10,0x3C,0x18,/*"*",10*/
0x10,0x10,0x7C,0x10,/*"+",11*/
0x00,0xC0,0x00,0x00,/*",",12*/
0x10,0x10,0x10,0x10,/*"-",13*/
0x00,0x40,0x00,0x00,/*".",14*/
0x80,0x70,0x1C,0x02,/*"/",15*/
0x38,0x44,0x38,0x00,/*"0",16*/
0x00,0x44,0x7C,0x40,/*"1",17*/
0x6C,0x54,0x4C,0x00,/*"2",18*/
0x44,0x54,0x6C,0x00,/*"3",19*/
0x30,0x68,0x7C,0x60,/*"4",20*/
0x4C,0x4C,0x7C,0x00,/*"5",21*/
0x78,0x4C,0x7C,0x00,/*"6",22*/
0x00,0x04,0x7C,0x00,/*"7",23*/
0x6C,0x54,0x6C,0x00,/*"8",24*/
0x5C,0x54,0x3C,0x00,/*"9",25*/
0x00,0x00,0x48,0x00,/*":",26*/
0x00,0x00,0xC8,0x00,/*";",27*/
0x00,0x18,0x24,0x42,/*"<",28*/
0x18,0x18,0x18,0x18,/*"=",29*/
0x00,0x42,0x24,0x18,/*">",30*/
0x00,0x0C,0x54,0x0C,/*"?",31*/
0x3C,0x7A,0x76,0x7C,/*"@",32*/
0x40,0x38,0x38,0x40,/*"A",33*/
0x44,0x7C,0x7C,0x00,/*"B",34*/
0x38,0x44,0x44,0x00,/*"C",35*/
0x44,0x7C,0x38,0x00,/*"D",36*/
0x00,0x7C,0x7C,0x00,/*"E",37*/
0x40,0x7C,0x7C,0x00,/*"F",38*/
0x38,0x64,0x64,0x20,/*"G",39*/
0x00,0x7C,0x7C,0x00,/*"H",40*/
0x00,0x44,0x7C,0x44,/*"I",41*/
0x80,0x84,0xFC,0x04,/*"J",42*/
0x00,0x7C,0x44,0x00,/*"K",43*/
0x40,0x7C,0x44,0x00,/*"L",44*/
0x7C,0x60,0x7C,0x00,/*"M",45*/
0x40,0x7C,0x7C,0x04,/*"N",46*/
0x38,0x44,0x38,0x00,/*"O",47*/
0x40,0x7C,0x5C,0x00,/*"P",48*/
0x38,0x64,0xF8,0x00,/*"Q",49*/
0x00,0x7C,0x3C,0x40,/*"R",50*/
0x4C,0x54,0x7C,0x00,/*"S",51*/
0x04,0x44,0x7C,0x44,/*"T",52*/
0x00,0x7C,0x7C,0x00,/*"U",53*/
0x0C,0x30,0x30,0x0C,/*"V",54*/
0x1C,0x24,0x7C,0x0C,/*"W",55*/
0x6C,0x10,0x6C,0x00,/*"X",56*/
0x04,0x48,0x70,0x48,/*"Y",57*/
0x64,0x54,0x4C,0x00,/*"Z",58*/
0x00,0x00,0xFE,0x00,/*"[",59*/
0x00,0x06,0x38,0xC0,/*"\",60*/
0x00,0xFE,0x00,0x00,/*"]",61*/
0x00,0x01,0x00,0x01,/*"^",62*/
0x80,0x80,0x80,0x80,/*"_",63*/
0x00,0x00,0x01,0x00,/*"`",64*/
0x68,0x68,0x78,0x40,/*"a",65*/
0x00,0x7E,0x78,0x00,/*"b",66*/
0x70,0x48,0x48,0x00,/*"c",67*/
0x78,0x4A,0x7E,0x00,/*"d",68*/
0x00,0x78,0x78,0x00,/*"e",69*/
0x48,0x7E,0x4A,0x00,/*"f",70*/
0xF8,0xA8,0xB8,0xC8,/*"g",71*/
0x42,0x7E,0x78,0x00,/*"h",72*/
0x00,0x48,0x7A,0x40,/*"i",73*/
0x00,0x88,0xFA,0x00,/*"j",74*/
0x00,0x7E,0x38,0x00,/*"k",75*/
0x00,0x42,0x7E,0x40,/*"l",76*/
0x78,0x08,0x78,0x08,/*"m",77*/
0x48,0x78,0x78,0x00,/*"n",78*/
0x70,0x48,0x78,0x00,/*"o",79*/
0x00,0xF8,0xF8,0x00,/*"p",80*/
0x78,0xC8,0xF8,0x00,/*"q",81*/
0x48,0x78,0x48,0x00,/*"r",82*/
0x00,0x78,0x78,0x00,/*"s",83*/
0x08,0x7C,0x48,0x00,/*"t",84*/
0x00,0x78,0x78,0x00,/*"u",85*/
0x18,0x20,0x20,0x18,/*"v",86*/
0x18,0x68,0x78,0x08,/*"w",87*/
0x48,0x30,0x48,0x00,/*"x",88*/
0x88,0xD8,0x38,0x08,/*"y",89*/
0x00,0x78,0x78,0x00,/*"z",90*/
0x00,0x10,0xFE,0x82,/*"{",91*/
0x00,0x00,0xFF,0x00,/*"|",92*/
0x82,0xFE,0x10,0x00,/*"}",93*/
0x01,0x01,0x02,0x02,/*"~",94*/
};

/**
  * 数据存储格式：
  * 纵向8点，高位在下，先从左到右，再从上到下
  * 每一个Bit对应一个像素点
  * 
  *      B0 B0                  B0 B0
  *      B1 B1                  B1 B1
  *      B2 B2                  B2 B2
  *      B3 B3  ------------->  B3 B3 --
  *      B4 B4                  B4 B4  |
  *      B5 B5                  B5 B5  |
  *      B6 B6                  B6 B6  |
  *      B7 B7                  B7 B7  |
  *                                    |
  *  -----------------------------------
  *  |   
  *  |   B0 B0                  B0 B0
  *  |   B1 B1                  B1 B1
  *  |   B2 B2                  B2 B2
  *  --> B3 B3  ------------->  B3 B3
  *      B4 B4                  B4 B4
  *      B5 B5                  B5 B5
  *      B6 B6                  B6 B6
  *      B7 B7                  B7 B7
  * 
  * 坐标轴定义：
  * 左上角为(0, 0)点
  * 横向向右为X轴，取值范围：0~127
  * 纵向向下为Y轴，取值范围：0~63
  * 
  *       0             X轴           127 
  *      .------------------------------->
  *    0 |
  *      |
  *      |
  *      |
  *  Y轴 |
  *      |
  *      |
  *      |
  *   63 |
  *      v
  * 
  */


/*全局变量*********************/

/**
  * OLED显存数组
  * 所有的显示函数，都只是对此显存数组进行读写
  * 随后调用OLED_Update函数或OLED_UpdateArea函数
  * 才会将显存数组的数据发送到OLED硬件，进行显示
  */
uint8_t OLED_DisplayBuf[8][128];

/*********************全局变量*/



/**
  * 函    数：OLED写命令
  * 参    数：Command 要写入的命令值，范围：0x00~0xFF
  * 返 回 值：无
  */
void OLED_WriteCommand(uint8_t Command,I2C_TYPE i2c_type,I2CX_Typedef i2cx)
{
	if(i2c_type == S_I2C)
	{
		JI2C_Start(i2cx);
		JI2C_SendByte(0x78,i2cx);
		JI2C_WaitAck(i2cx);
		
