JackTJH/STM32F407/21_AD9833(Pro)Practice/APPLICATION/OLED(0.96)/OLED.c
		JI2C_SendByte(0x00,i2cx);
		JI2C_WaitAck(i2cx);
		
		JI2C_SendByte(Command,i2cx);
		JI2C_WaitAck(i2cx);
		
		JI2C_Stop(i2cx);	
	}
	else
	{
		I2C_GenerateSTART(JI2X[i2cx], ENABLE);
		JI2CXX_WaitEvent(i2cx,I2C_EVENT_MASTER_MODE_SELECT);

		I2C_Send7bitAddress(JI2X[i2cx], 0x78, I2C_Direction_Transmitter);
		JI2CXX_WaitEvent(i2cx,I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED);
		
		I2C_SendData(JI2X[i2cx], 0x00);
		JI2CXX_WaitEvent(i2cx,I2C_EVENT_MASTER_BYTE_TRANSMITTING);
		
		I2C_SendData(JI2X[i2cx], Command);
		JI2CXX_WaitEvent(i2cx,I2C_EVENT_MASTER_BYTE_TRANSMITTED);

		I2C_GenerateSTOP(JI2X[i2cx], ENABLE);
	}
}

/**
  * 函    数：OLED写数据
  * 参    数：Data 要写入数据的起始地址
  * 参    数：Count 要写入数据的数量
  * 返 回 值：无
  */
void OLED_WriteData(uint8_t *Data, uint8_t Count,I2C_TYPE i2c_type,I2CX_Typedef i2cx)
{
	uint8_t i;
	
	if(i2c_type == S_I2C)
	{
		JI2C_Start(i2cx);
		JI2C_SendByte(0x78,i2cx);		//发送OLED的I2C从机地址
		JI2C_WaitAck(i2cx);

		JI2C_SendByte(0x40,i2cx);		//控制字节，给0x40，表示即将写数据
		JI2C_WaitAck(i2cx);

		/*循环Count次，进行连续的数据写入*/
		for (i = 0; i < Count; i ++)
		{
			JI2C_SendByte(Data[i],i2cx);	//依次发送Data的每一个数据
			JI2C_WaitAck(i2cx);
		}
		JI2C_Stop(i2cx);	
	}
	else
	{
		I2C_GenerateSTART(JI2X[i2cx], ENABLE);
		JI2CXX_WaitEvent(i2cx,I2C_EVENT_MASTER_MODE_SELECT);

		I2C_Send7bitAddress(JI2X[i2cx], 0x78, I2C_Direction_Transmitter);
		JI2CXX_WaitEvent(i2cx,I2C_EVENT_MASTER_BYTE_TRANSMITTING);
		
		I2C_SendData(JI2X[i2cx], 0x40);
		JI2CXX_WaitEvent(i2cx,I2C_EVENT_MASTER_BYTE_TRANSMITTING);
		
		for(i = 0; i < Count; i++)
		{
			I2C_SendData(JI2X[i2cx], Data[i]);
			JI2CXX_WaitEvent(i2cx,I2C_EVENT_MASTER_BYTE_TRANSMITTING);
		}	
		I2C_GenerateSTOP(JI2X[i2cx], ENABLE);
	}

}

/*********************通信协议*/


/*硬件配置*********************/

/**
  * 函    数：OLED初始化
  * 参    数：无
  * 返 回 值：无
  * 说    明：使用前，需要调用此初始化函数
  */
void OLED_Init(I2C_TYPE i2c_type,I2CX_Typedef i2cx)
{
	/*写入一系列的命令，对OLED进行初始化配置*/
	OLED_WriteCommand(0xAE,i2c_type,i2cx);	//设置显示开启/关闭，0xAE关闭，0xAF开启
	
	OLED_WriteCommand(0xD5,i2c_type,i2cx);	//设置显示时钟分频比/振荡器频率
	OLED_WriteCommand(0x80,i2c_type,i2cx);	//0x00~0xFF
	
	OLED_WriteCommand(0xA8,i2c_type,i2cx);	//设置多路复用率
	OLED_WriteCommand(0x3F,i2c_type,i2cx);	//0x0E~0x3F
	
	OLED_WriteCommand(0xD3,i2c_type,i2cx);	//设置显示偏移
	OLED_WriteCommand(0x00,i2c_type,i2cx);	//0x00~0x7F
	
	OLED_WriteCommand(0x40,i2c_type,i2cx);	//设置显示开始行，0x40~0x7F
	
	OLED_WriteCommand(0xA1,i2c_type,i2cx);	//设置左右方向，0xA1正常，0xA0左右反置
	
	OLED_WriteCommand(0xC8,i2c_type,i2cx);	//设置上下方向，0xC8正常，0xC0上下反置

	OLED_WriteCommand(0xDA,i2c_type,i2cx);	//设置COM引脚硬件配置
	OLED_WriteCommand(0x12,i2c_type,i2cx);
	
	OLED_WriteCommand(0x81,i2c_type,i2cx);	//设置对比度
	OLED_WriteCommand(0xFF,i2c_type,i2cx);	//0x00~0xFF

	OLED_WriteCommand(0xD9,i2c_type,i2cx);	//设置预充电周期
	OLED_WriteCommand(0xF1,i2c_type,i2cx);

	OLED_WriteCommand(0xDB,i2c_type,i2cx);	//设置VCOMH取消选择级别
	OLED_WriteCommand(0x30,i2c_type,i2cx);

	OLED_WriteCommand(0xA4,i2c_type,i2cx);	//设置整个显示打开/关闭

	OLED_WriteCommand(0xA6,i2c_type,i2cx);	//设置正常/反色显示，0xA6正常，0xA7反色

	OLED_WriteCommand(0x8D,i2c_type,i2cx);	//设置充电泵
	OLED_WriteCommand(0x14,i2c_type,i2cx);

	OLED_WriteCommand(0xAF,i2c_type,i2cx);	//开启显示
	
	OLED_Clear();				//清空显存数组
	OLED_Update(i2c_type,i2cx);				//更新显示，清屏，防止初始化后未显示内容时花屏
}

/**
  * 函    数：OLED设置显示光标位置
  * 参    数：Page 指定光标所在的页，范围：0~7
  * 参    数：X 指定光标所在的X轴坐标，范围：0~127
  * 返 回 值：无
  * 说    明：OLED默认的Y轴，只能8个Bit为一组写入，即1页等于8个Y轴坐标
  */
//void OLED_SetCursor(uint8_t Page, uint8_t X,I2C_TYPE i2c_type,I2CX_Typedef i2cx)
//{
//	/*如果使用此程序驱动1.3寸的OLED显示屏，则需要解除此注释*/
//	/*因为1.3寸的OLED驱动芯片（SH1106）有132列*/
//	/*屏幕的起始列接在了第2列，而不是第0列*/
//	/*所以需要将X加2，才能正常显示*/
////	X += 2;
//	
//	/*通过指令设置页地址和列地址*/
//	OLED_WriteCommand(0xB0 | Page,i2c_type,i2cx);					//设置页位置
//	OLED_WriteCommand(0x10 | ((X & 0xF0) >> 4),i2c_type,i2cx);	//设置X位置高4位
//	OLED_WriteCommand(0x00 | (X & 0x0F),i2c_type,i2cx);			//设置X位置低4位
//}
void OLED_WriteData1(uint8_t Data,I2C_TYPE i2c_type,I2CX_Typedef i2cx)
{
	
	JI2C_Start(i2cx);
	JI2C_SendByte(0x78,i2cx);		//发送OLED的I2C从机地址
	JI2C_WaitAck(i2cx);

	JI2C_SendByte(0x40,i2cx);		//控制字节，给0x40，表示即将写数据
	JI2C_WaitAck(i2cx);

	JI2C_SendByte(Data,i2cx);	//依次发送Data的每一个数据
	JI2C_WaitAck(i2cx);
	JI2C_Stop(i2cx);	
}

void OLED_SetCursor(uint8_t Page, uint8_t X,I2C_TYPE i2c_type,I2CX_Typedef i2cx)
{
	OLED_WriteCommand(0x00 | (X&0X0F),i2c_type,i2cx);
	OLED_WriteCommand(0x10 | ((X&0XF0)>>4),i2c_type,i2cx);
	OLED_WriteCommand(0xB0 | Page,i2c_type,i2cx);
}

void OLED_Clear1(void)
{
	for(uint8_t j = 0; j < 8; j++)
	{
		OLED_SetCursor(j,0,I2C1MODE,JI2C2);
		for(uint8_t i = 0; i < 128; i++)
		{
			OLED_DisplayBuf[j][i] = 0x00;
//			OLED_WriteData1(0x00,I2C1MODE,JI2C2);
		}
	}
}

void OLED_ShowChar1(int16_t Page, int16_t X, char Char,uint8_t fontsize)
{
	
	if(fontsize == 6)
	{
		OLED_ShowImage1(Page,X,6,1,OLED_F6x8[Char - ' ']);
	}
	else if(fontsize == 8)
	{
		OLED_ShowImage1(Page,X,8,2,font8_16[Char - ' ']);
	}
}

void OLED_ShowString1(int16_t Page, int16_t X, char *String, uint8_t FontSize)
{
	for(uint8_t i = 0; String[i] != '\0'; i++)
	{
		OLED_ShowChar1(Page,X+i*FontSize,String[i],FontSize);
	}
}

void OLED_ShowImage1(int16_t Page, int16_t X, uint8_t Width, uint8_t Height, const uint8_t *Image)
{
	for(uint8_t j = 0; j < Height; j++)
	{
//		OLED_SetCursor(Page+j,X,I2C1MODE,JI2C2);
		for(uint8_t i = 0; i < Width; i++)
		{
			OLED_DisplayBuf[j+Page][X+i] = Image[Width*j+i];
//			OLED_WriteData1(Image[Width*j+i],I2C1MODE,JI2C2);
		}
	}
}

typedef struct
{
	char Index[4];
	char Data[16*8];
}MyChineseCell_t;

const MyChineseCell_t image1[]= {
"唐",
0x00,0x00,0x00,0x00,0x00,0xE0,0xC0,0x40,0x40,0x40,0x40,0x40,0x40,0x40,0x40,0x44,
0xCC,0xF8,0x70,0x40,0x40,0x40,0x40,0x40,0x40,0x40,0x60,0x60,0x40,0x00,0x00,0x00,
0x00,0x00,0x00,0x00,0x00,0xFF,0xFF,0x40,0x40,0x44,0x44,0x44,0x44,0x44,0x44,0x44,
0xFF,0xFF,0x44,0x44,0x44,0x44,0x44,0x44,0xFE,0xFC,0x44,0x60,0x60,0x40,0x00,0x00,
0x00,0x00,0x00,0x00,0x80,0xFF,0x3F,0x00,0x00,0x04,0xC4,0xC4,0x44,0x44,0x44,0x44,
0x7F,0x7F,0x44,0x44,0x44,0x44,0x44,0x44,0xEF,0xCF,0x40,0x00,0x00,0x00,0x00,0x00,
0x00,0x40,0x20,0x1C,0x07,0x01,0x00,0x00,0x00,0x00,0x3F,0x3F,0x10,0x10,0x10,0x10,
0x10,0x10,0x10,0x10,0x10,0x10,0x10,0x10,0x3F,0x3F,0x00,0x00,0x00,0x00,0x00,0x00,/*"唐",0*/
"佳",
0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x80,0xF0,0x78,0x18,0x00,0x00,0x00,0x00,0x00,
0x00,0x00,0x00,0xFC,0xF8,0x08,0x00,0x00,0x00,0x80,0x80,0x00,0x00,0x00,0x00,0x00,
0x00,0x00,0x00,0x80,0x60,0x30,0x0C,0xFF,0xF9,0x00,0x40,0x40,0x41,0x41,0x41,0x41,
0x41,0x41,0x41,0x7F,0x7F,0x41,0x41,0x41,0x41,0x41,0x41,0x61,0x60,0x40,0x00,0x00,
0x00,0x02,0x01,0x00,0x00,0x00,0x00,0xFF,0xFF,0x00,0x00,0x00,0x20,0x20,0x20,0x20,
0x20,0x20,0x20,0xFF,0xFF,0x22,0x20,0x20,0x20,0x20,0x30,0x20,0x00,0x00,0x00,0x00,
0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x7F,0x3F,0x10,0x10,0x10,0x10,0x10,0x10,0x10,
0x10,0x10,0x10,0x1F,0x1F,0x10,0x10,0x10,0x10,0x10,0x10,0x18,0x18,0x10,0x00,0x00,/*"佳",1*/
"辉",
0x00,0x00,0x20,0xC0,0x80,0x00,0x00,0xFC,0xF8,0x08,0x00,0x80,0xE0,0x40,0x80,0xC0,
0xF8,0x10,0x10,0x10,0xD0,0x90,0x90,0x10,0x10,0x10,0x90,0x70,0x38,0x30,0x00,0x00,
0x00,0x40,0x40,0x40,0x4F,0xC6,0xC0,0x7F,0x7F,0xD0,0xCC,0x43,0x41,0x60,0x41,0x09,
0x88,0xE8,0x78,0x1F,0x0F,0x29,0xC8,0x48,0x08,0x08,0x08,0x0C,0x08,0x00,0x00,0x00,
0x00,0x00,0x00,0x00,0x80,0xFF,0x0F,0x00,0x00,0xFF,0xFF,0x00,0x80,0x40,0xA0,0x83,
0x83,0x82,0x82,0x82,0x82,0x82,0xFF,0x82,0x82,0x82,0x82,0x83,0xC2,0x80,0x00,0x00,
0x00,0x40,0x30,0x0C,0x07,0x00,0x00,0x00,0x00,0x07,0x0F,0x03,0x01,0x00,0x00,0x00,
0x00,0x00,0x00,0x00,0x00,0x00,0x7F,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,/*"辉",2*/
"",
0x00,0x00,0x00,0x00,0x80,0x80,0x40,0x40,0x40,0x40,0x40,0x80,0x80,0x00,0x00,0x00,
0x00,0x00,0x3C,0x3F,0x39,0x00,0x00,0x00,0x00,0x00,0x00,0x80,0xC1,0x7F,0x3E,0x00,
0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x3E,0x03,0x01,0x01,0x00,0x00,0x00,0x00,
0x00,0x00,0x00,0x00,0x00,0x00,0x06,0x0F,0x0F,0x06,0x00,0x00,0x00,0x00,0x00,0x00,/*"?",0*/

